{
    "apibase": "https://localhost:7240/",
    "en.apibase": "https://en.localhost:7240.",
    "tm.apibase": "https://tm.localhost:7240",
    "domain": "localhost",
    "api": "api/",
    "centerBox": {
        "flex": 1,
        "display": "flex",
        "flexWrap": "wrap",
        "alignContent": "center",
        "justifyContent": "center"
    },
    "text": {
        "text": "Текст",
        "exit": "Выход",
        "search": "Поиск",
        "filtersearch": "Поиск или фильтр",
        "aboutRu": "О нас",
        "deliveryRu": "Доставка",
        "aboutEn": "About",
        "deliveryEn": "Delivery",
        "aboutTk": "Biz hakynda",
        "deliveryTk": "Eltip bermek",
        "content": "Контент",
        "content2": "контент",
        "log": "Логин",
        "password": "Пароль",
        "loginError": "Не верный логин или пароль",
        "wrong": "Что-то пошло не так. Попробуйте позже или обратитесть в службу поддержки сайта.",
        "noProduct": "Вы не выбрали товары для акции!",
        "noSet": "Вы не выбрали товары для набора!",
        "noPresent": "Вы не выбрали подарок для акции!",
        "noPurchase": "Вы не добавили товар. Без товара невозможно оформить покупку!",
        "nullPurchase": "У вас в списке есть товар с ценой 0! Если это ВЕРНО, ничего не меняйте и продолжайте! Если это НЕ ВЕРНО, отредактируйте цены!",
        "notDeleted": "Не удалось удалить объект! Возможно, есть связанные дочерние объекты или удален ранее.",
        "notModified": "Не удалось изменить объект! Возможно, удален ранее.",
        "login": "Логин",
        "empty": "Это поле не должно быть пустым!",
        "already": "Не удалось добавить сотрудника. Возможно, сотрудник с таким логином уже существует.",
        "already2": "Действие не удалось! Возможно, объект с таким именем уже существует.",
        "alreadyModel": "Действие не удалось! Возможно, модель с таким именем уже существует или вы выбрали одинаковые значения для характеристик товаров.",
        "noHeading": "Действие не удалось! Вы не выбрали ни одного заголовка.",
        "maxLength": "Действие не удалось! Длина строки превышает максимально доспустимое значение: ",
        "deleteHeadingError": "Действие не удалось! Выделенный заголовок удалить нельзя, сначала удалите все статьи данного заголовка!",
        "bindedOrder": "Действие не удалось! Возможно, объект уже применен в продажах, т.е связан с инвойсами.",
        "deliveredInvoice": "Действие не удалось! Редактирование инвойса не возможно, если он уже оплачен или доставлен!",
        "noImageCategory": "Действие не удалось! Категория на первой странице, должна иметь изображение!",
        "sa403": "Действие не удалось! У вас нет прав доступа для этого действия!",
        "s403": "У вас нет прав доступа к этой информации!",
        "add": "Добавить",
        "addNewHeading": "Добавить новый заголовок",
        "edit": "Изменить",
        "yes": "Да",
        "no": "Нет",
        "nofile": "Не выбран ни один файл",
        "noObject": "Ни одного объекта нет!",
        "type": "Тип",
        "types": "Типы",
        "type2": "тип",
        "type3": "Вид",
        "category": "Категория",
        "categories": "Категории",
        "category2": "категорию",
        "brand": "Бренд",
        "brands": "Бренды",
        "brand2": "бренд",
        "line": "Серия",
        "lines": "Серии",
        "line2": "серию",
        "model": "Модель",
        "models": "Модели",
        "model2": "модель",
        "warranty": "Гарантия",
        "warranties": "Гарантии",
        "warranty2": "гарантию",
        "supplier": "Поставщик",
        "suppliers": "Поставщики",
        "supplier2": "поставщика",
        "purchaseInvoice": "Приходный ордер",
        "purchaseInvoices": "Приходные ордера",
        "purchaseInvoice2": "приходный ордер",
        "invoice": "Инвойс",
        "invoices": "Инвойсы",
        "invoice2": "инвойс",
        "currency": "Валюта",
        "currencies": "Валюты",
        "currency2": "валюту",
        "slide": "Слайд",
        "slides": "Слайды",
        "slide2": "слайд",
        "layout": "Расположение",
        "spec": "Характеристика",
        "specs": "Характеристики",
        "spec2": "характеристику",
        "specsvalues": "Значения характеристики ",
        "specsValues": "Значения",
        "specsvaluemods": "Разновидности значения ",
        "specsValueMods": "Разновидности значений",
        "product": "Товар",
        "products": "Товары",
        "product2": "товар",
        "promotion": "Акция",
        "promotions": "Акции",
        "promotion2": "акцию",
        "article": "Статья",
        "articles": "Статьи",
        "article2": "статью",
        "headings": "Заголовки",
        "partNo": "Артикул",
        "employee": "Cотрудник",
        "employees": "Сотрудники",
        "employee2": "сотрудника",
        "position": "Позиция",
        "positions": "Позиции",
        "position2": "позицию",
        "entry": "Хронология",
        "entries": "Хронология",
        "entry2": "хронологию",
        "productId": "Id товара",
        "purchaseId": "Id складского прихода",
        "id": "#",
        "name": "Название",
        "humanName": "Имя",
        "nameRu": "Название (на рус.)",
        "nameEn": "Название (на анг.)",
        "nameTm": "Название (на тур.)",
        "descRu": "Описание (на рус.)",
        "descEn": "Описание (на анг.)",
        "descTm": "Описание (на тур.)",
        "ruVer": "рус. версия",
        "enVer": "анг. версия",
        "tmVer": "тур. версия",
        "order": "Порядковый номер",
        "parentId": "Родительская категория",
        "isRecommended": "Рекомендуемый",
        "isRecommendedShort": "Рек",
        "notInUse": "Не активный",
        "isInUse": "Активный",
        "isInUseShort": "Акт",
        "isNew": "Новинка",
        "isNewShort": "Нов",
        "isForHome": "На домашней",
        "isForHomeShort": "Дом",
        "onOrder": "Под заказ",
        "level": "Уровень доступа",
        "parent": "Материнская категория",
        "stepParents": "Дополнительные связи",
        "price": "Цена",
        "newPrice": "Новая цена",
        "namingOrder": "Место в названии",
        "link": "Ссылка",
        "codeName": "Код валюты",
        "priceRate": "Расчетный курс",
        "realRate": "Реальный курс",
        "isNameUse": "Использовать в названии",
        "isFilter": "Фильтр",
        "isImaged": "Изображение",
        "phoneMain": "Телефон",
        "phoneSecondary": "Дополнительный телефон",
        "address": "Адрес",
        "recipient": "Получатель",
        "serialNumber": "Серийный номер",
        "serialNumbers": "Серийные номера",
        "purchasePrice": "Цена покупки",
        "orderPrice": "Цена",
        "quantity": "Количество",
        "amount": "Сумма",
        "act": "Действие",
        "entity": "Раздел",
        "entityId": "№",
        "entityName": "Название",
        "date": "Дата",
        "supplierName": "Поставщик",
        "currencyCodeName": "Валюта",
        "currencyRate": "Курс",
        "purchases": "Наименования",
        "notAllSpecs": "Вы не заполнили все значения характеристик.",
        "user": "Пользователь",
        "users": "Пользователи",
        "user2": "пользователя",
        "orders": "Товары",
        "invoiceOrders": "Заказы",
        "availablePurchases": "Товары на складе",
        "purchaseInvoiceId": "П.о. #",
        "invoicePhone": "Номер телефона получателя",
        "deliveryCost": "Стоимость доставки",
        "process": "Обработать",
        "print": "Печатать",
        "buyer": "Получатель",
        "phone": "Телефон",
        "email": "Email",
        "isDelivered": "Доставлено",
        "isPaid": "Оплачено",
        "report": "Отчет за период",
        "invoiceId": "Инвойс #",
        "invoiceDate": "Дата инвойса",
        "paidDate": "Оплата",
        "productName": "Наименование",
        "orderCurrency": "Валюта",
        "purchaseCurrency": "Валюта",
        "orderCurrencyRate": "Курс",
        "purchaseCurrencyRate": "Курс",
        "soldPrice": "Цена в в.",
        "boughtPrice": "Цена в в.",
        "netProfit": "Прибыль",
        "discountVolume": "Размер скидки",
        "discountedProducts": "Выбрать товары для акции",
        "quantityOfProducts": "Необходимое количество",
        "setProducts": "Выбрать товары для набора",
        "selectPresent": "Выбрать подарок",
        "selectSpecial": "Выбрать товар со скидкой",
        "0": "ru",
        "1": "en",
        "2": "tm",
        "0.invoice": "Инвойс",
        "0.productId": "#",
        "0.user": "Пользователь",
        "0.buyer": "Получатель",
        "0.date": "Дата",
        "0.address": "Адрес",
        "0.phone": "Телефон",
        "0.name": "Наименование",
        "0.serialNumbers": "Серийные номера",
        "0.warranty": "Гарантия",
        "0.orderPrice": "Цена",
        "0.quantity": "Количество",
        "0.sum": "Сумма",
        "0.deliveryCost": "Доставка",
        "0.amount": "Сумма",
        "1.invoice": "Invoice",
        "1.productId": "#",
        "1.user": "User",
        "1.buyer": "Recipient",
        "1.date": "Date",
        "1.address": "Address",
        "1.phone": "Phone",
        "1.name": "Product",
        "1.serialNumbers": "Serial Numbers",
        "1.warranty": "Warranty",
        "1.orderPrice": "Price",
        "1.quantity": "Quantity",
        "1.sum": "Sum",
        "1.deliveryCost": "Delivery",
        "1.amount": "Amount",
        "2.invoice": "Hasap",
        "2.productId": "#",
        "2.user": "Ulanyjy",
        "2.buyer": "Alyjy",
        "2.date": "Sene",
        "2.address": "Salgy",
        "2.phone": "Telefon",
        "2.name": "Önüm",
        "2.serialNumbers": "Serial nomerler",
        "2.warranty": "Kepillik",
        "2.orderPrice": "Nyrh",
        "2.quantity": "San",
        "2.sum": "Jemi",
        "2.deliveryCost": "Eltip bermek",
        "2.amount": "Jemi",
        "0.wt": "Условия гарантии",
        "1.wt": "Warranty Terms",
        "2.wt": "Kepillik şertleri",
        "0.wLine": "Гарантийный срок на каждый товар указан в соответствующей строке данного инвойса",
        "1.wLine": "The warranty period for each product is specified in the corresponding line of this invoice",
        "2.wLine": "Her önüm üçin kepillik möhleti, bu hasabyň degişli setirinde görkezilen",
        "0.wProvide": "Гарантия обеспечивает бесплатный ремонт изделия (в случае невозможности ремонта - замену), указанного в инвойсе в течение всего гарантийного срока",
        "1.wProvide": "The warranty provides for free repair of the product (in case of repair failure - replacement) specified in the invoice during the entire warranty period",
        "2.wProvide": "Kepillik, tutuş kepillik döwründe hasapda görkezilen önümi mugt bejermegi üpjün edýär (bejermek mümkin däl bolsa - çalyşmagy)",
        "0.wCond": "Гарантия предоставляется при соблюдении следующих условий",
        "1.wCond": "The warranty is subject to the following conditions",
        "2.wCond": "Kepillik aşakdaky şertler bozulmadyk halatynda degişlidir",
        "0.wSeal": "При наличии инвойса с печатью и подписью продавца, в котором четко прописано наименования изделия",
        "1.wSeal": "If there is an invoice with the seal and signature of the seller, which clearly states the name of the product",
        "2.wSeal": "Satyjynyň möhri we goly bar bolan hasapda önüminiň ady anyk görkezilen bolsa",
        "0.wSticker": "Наличие неповреждённого гарантийного стикера (пломбы) на изделии",
        "1.wSticker": "The presence of an intact warranty sticker (seal) on the product",
        "2.wSticker": "Önümde kepillik stikeri (möhüri) bolmaly",
        "0.wDefect": "Не подлежат гарантийному ремонту изделия с дефектами, возникшими вследствие",
        "1.wDefect": "Not covered under warranty the products with defects resulting from",
        "2.wDefect": "Aşakda sanalan şertler netijesinde kemçilikli önümler kepillik bilen üpjün edilmeýär",
        "0.wNonobs": "Несоблюдения условий эксплуатации, неправильной установки, механических, химических и (или) термических повреждений и (или) ошибочных действий владельца (на изделии появились сгоревшие детали, видны следы выгорания деталей и т.п.)",
        "1.wNonobs": "Non-observance of operating conditions, improper installation, mechanical, chemical and (or) thermal damage and (or) erroneous actions of the owner (burnt parts appeared on the product, traces of burnt parts are visible, etc.)",
        "2.wNonobs": "Iş şertleriniň berjaý edilmezligi, nädogry gurnama, mehaniki, himiki we (ýa-da) ýylylyk zaýalanmagy we (ýa-da) eýesiniň ýalňyş hereketleri (önümde ýakylan bölekler peýda boldy, ýakylýan bölekleriň yzlary görünýär we ş.m.)",
        "0.wDamage": "Повреждений, вызванных использованием изделий в целях, выходящих за рамки личных бытовых нужд",
        "1.wDamage": "Damage caused by the use of products for purposes other than personal household needs",
        "2.wDamage": "Önümleriň şahsy durmuş zerurlyklaryndan başga maksatlar üçin ulanylmagy sebäpli dörän zyýan",
        "0.wOver": "Перегрузки, неправильной и небрежной эксплуатацией, проникновением жидкостей, пыли, насекомых и других посторонних предметов внутрь изделия, отложения накипи независимо от используемой воды, воздействия высоких температур на пластмассовые и другие нетермостойкие части, действия непреодолимой силы (несчастный случай, пожар, наводнение, неисправность электрической сети, удар молнии), а также других причин, находящихся вне контроля продавца и изготовителя",
        "1.wOver": "Overloading, improper and careless operation, penetration of liquids, dust, insects and other foreign objects into the product, scale deposits regardless of the water used, exposure to high temperatures on plastic and other non-heat-resistant parts, force majeure (accident, fire, flood, electrical network, lightning strike), as well as other reasons beyond the control of the seller and the manufacturer",
        "2.wOver": "Artykmaç elektriki hadysa, nädogry we biperwaý işletmek, suwuklyklaryň, tozanyň, mör-möjekleriň we beýleki artykmaç zatlarynyň önüme aralaşmagy, ulanylan suwa garamazdan hapanyň döremegi, plastmassa we beýleki ýylylyga çydamly däl böleklerde ýokary temperaturanyň täsir edilmegi, ýeňip bolmajak ýagdaýlarda (awariýa, ýangyn, suw joşmasy, elektrik ulgamy, ýyldyrym çakmagy), şeýle hem satyjynyň we öndürijiniň göz önünde tutmadyk sebäplerde",
        "0.wRepair": "Ремонта и (или) внесения конструктивных изменений в изделие и (или) его комплектующих неуполномоченными лицами. Такие действия может проводить только АСЦ",
        "1.wRepair": "Repair and (or) making structural changes to the product and (or) its components by unauthorized persons. Such actions can only be carried out by the ASC",
        "2.wRepair": "Rugsat berilmedik adamlar tarapyndan önümde we (ýa-da) düzüm böleklerinde abatlaýyş we (ýa-da) gurluş üýtgetmeleri girizmeleri. Şeýle hereketler diňe serwis merkezleri tarapyndan amala aşyrylyp bilner",
        "0.wResulting": "Повреждений, возникших вследствие небрежного хранения и (или) транспортировки",
        "1.wResulting": "Damage resulting from careless storage and/or transportation",
        "2.wResulting": "Seresapsyz saklamak we (ýa-da) daşamak netijesinde dörän zyýan",
        "0.wChange": "Внесения изменений и (или) исправлений в гарантийный талон (инвойс), не заверенные печатью и подписью Продавца",
        "1.wChange": "Making changes and (or) corrections to the warranty card (invoice) that are not certified by the seal and signature of the Seller",
        "2.wChange": "Satyjynyň möhri we goly bilen tassyklanmadyk kepillik petegine (hasaba) üýtgetmeler we (ýa-da) düzedişler girizlende",
        "0.wNotCover": "Гарантия не распространяется на",
        "1.wNotCover": "The warranty does not cover",
        "2.wNotCover": "Kepillik öz içine almaýar",
        "0.wPackaging": "Упаковку изделия, расходные материалы и аксессуары (фильтры, сетки, мешки, картриджи, ножи, насадки, ремни, сальники, подшипники, пластмассовые и металлические изделия и т.п.)",
        "1.wPackaging": "Product packaging, consumables and accessories (filters, nets, bags, cartridges, knives, nozzles, belts, seals, bearings, plastic and metal products, etc.)",
        "2.wPackaging": "Önümiň gaby, sarp edilýän zatlar we esbaplar (süzgüçler, torlar, sumkalar, kartrijler, pyçaklar, burunlar, guşaklar, möhürler, podşipnikler, plastmassa we metal önümleri we ş.m.)",
        "0.wWear": "Естественный износ изделия",
        "1.wWear": "Natural wear of the product",
        "2.wWear": "Önümiň könelişmegi",
        "0.wCause": "Повреждения, вызванные самостоятельным изменением владельцем конструкции изделия или его комплектующих",
        "1.wCause": "Damage caused by an independent change by the owner of the design of the product or its components",
        "2.wCause": "Önümiň dizaýnynyň ýa-da onuň bölekleriniň eýesi tarapyndan özbaşdak üýtgemdilmegi netijesinde dörän zyýan",
        "0.wNotinc": "Гарантия не включает в себя периодическое обслуживание, установку, настройку изделия на дому у владельца",
        "1.wNotinc": "The warranty does not include periodic maintenance, installation, adjustment of the product at the owner's home",
        "2.wNotinc": "Kepillik önümiň eýesiniň öýünde wagtal-wagtal tehniki hyzmaty, gurnamagy, önümi sazlamagy öz içine almaýar",
        "0.wLoss": "Гарантия, предоставляемая продавцом, не обеспечивает возмещения прямых или косвенных убытков, потерь или ущерба (включая все, без исключения, случаи потери прибылей, прерывания деловой активности, либо других денежных затрат), а так же возмещения затрат, связанных с переездами и (или) транспортировкой изделия в уполномоченную ремонтную мастерскую. В любом случае возмещение, согласно данным условиям не может превышать стоимости, фактически уплаченной покупателем за единицу изделия, приведшую к убыткам",
        "1.wLoss": "The seller's warranty does not cover direct or indirect loss, loss or damage (including, without limitation, loss of profits, business interruption or other monetary costs), nor any costs associated with moving and/or transporting the product to an authorized repair shop. In any case, the refund, under these conditions, cannot exceed the cost actually paid by the buyer for the unit of the product that led to the loss",
        "2.wLoss": "Kepillik gönüden-göni ýa-da göni däl ýitgini ýa-da zyýany (islendik girdejini ýitirmek, işden kesilmegi ýa-da beýleki pul çykdajylary), önümi ygtyýarly abatlaýyş dükanyna geçirmek we (ýa-da) daşamak bilen baglanyşykly çykdajylary öz içine almaýar. Islendik ýagdaýda, yzyna gaýtarmaklyk, alyjynyň ýitgä sebäp bolan önümiň birligi üçin hakykatda tölän bahasyndan ýokary bolup bilmez",
        "0.wReserve": "Продавец оставляет за собой право на отказ в гарантийном обслуживании в случае непредставления вышеуказанных документов, если информация в них будет не полной, неразборчивой, противоречивой, а так же истёк срок гарантии",
        "1.wReserve": "The seller reserves the right to refuse warranty service in case of failure to submit the above documents, if the information in them is incomplete, illegible, contradictory, and the warranty period has expired",
        "2.wReserve": "Satyjy, ýokardaky resminamalar görkezilmedik ýagdaýynda, içindäki maglumatlar doly däl, bikanun, gapma-garşy bolsa ýa-da kepillik möhleti gutaran bolsa, kepillik hyzmatyndan ýüz öwürmek hukugyny özünde saklaýar."
    },
    "image": {
        "brand": "180x60",
        "category": "450x225 (необходимо, если \"На домашней\")",
        "product": "600x600",
        "promotion": "450x225",
        "slide": "600x300",
        "slideleft": "220x300",
        "specsValue": "25x25"
    },
    "phoneOnly": [
        "e",
        "E",
        "+",
        "-",
        ".",
        ","
    ],
    "decimalOnly": [
        "e",
        "E",
        "+",
        "-"
    ]
}